int/resources/objectRepo/xmlTemplates/opera/RatePlan/req_FetchRatePlanSchedules.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/par/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:FetchRatePlanSchedulesRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:Criteria MaxFetchCount="?" TierID="?">
            <v91:RatePlanScheduleID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
            <v91:HotelCode/>
            <v91:RatePlanCode/>
            <v91:ScheduleDateRange>
               <v91:StartDate/>
               <v91:EndDate/>
               <v91:Duration/>
            </v91:ScheduleDateRange>
            <v91:RoomTypeList>
               <v91:RoomType/>
            </v91:RoomTypeList>
            <v91:RoomClassList>
               <v91:RoomClass/>
            </v91:RoomClassList>
            <v91:IncludeInactive/>
         </v9:Criteria>
      </v9:FetchRatePlanSchedulesRQ>
   </soapenv:Body>
</soapenv:Envelope>